{
  "backend/main.mo": "Motoko backend canister handling user profiles, product catalog CRUD with admin authorization, and Stripe checkout/session integration.",
  "feature_evidence.json": "Metadata file listing implemented features, linked source files, components, and confidence annotations.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the roles of various frontend React components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables and theming for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the root React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for storefront, cart, payment, and admin pages wrapped in a ThemeProvider.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component that restricts access to children based on admin status, showing alerts for unauthenticated or unauthorized users.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and basic error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting first‑time users to enter a name and saving it to the backend.",
  "frontend/src/components/layout/StoreLayout.tsx": "Main store layout with header, cart indicator, admin link, profile greeting, footer, and conditional profile setup modal.",
  "frontend/src/components/store/ProductCard.tsx": "Displays a product with image, details, price, and an add-to-cart button with detail navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity state and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management via React context.",
  "frontend/src/hooks/useQueries.ts": "React Query wrappers for product, user profile, admin, Stripe, and mutation operations using the backend actor.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme CSS variables and global styles.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging and currency formatting.",
  "frontend/src/main.tsx": "App entry point configuring React Query, Internet Identity provider, and rendering the root app.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin landing page linking to product management and Stripe payment settings.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides CRUD UI for products, including creation, editing, deletion, and image upload handling.",
  "frontend/src/pages/admin/AdminStripeSetupPage.tsx": "Allows admins to configure Stripe secret keys and allowed countries, showing current configuration status.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page with item management, total price display, and Stripe checkout session creation.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Page shown on failed or canceled payments with navigation options back to cart or shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a success message after Stripe payment and clears the cart when the session is completed.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information with quantity controls and allows adding the item to the cart.",
  "frontend/src/pages/StorefrontPage.tsx": "Fetches and displays a product grid with options to view details or add items to the cart.",
  "frontend/src/state/cart.ts": "Zustand store managing cart items with add, remove, update, clear, and total calculation functions.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, container queries, animations, and plugin setup.",
  "project_state.json": "Defines project metadata, existing features, and pending feature requests for a store clone with Stripe and admin functionality."
}