{
  "kind": "build_request",
  "title": "Make Internet Identity admin login fully functional",
  "projectName": "Ocarina Store",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Ensure the backend exposes the admin/user role queries used by the frontend so Internet Identity authenticated users can be recognized as admins (for example: implement the canister methods expected by the UI such as `isCallerAdmin()` and `getCallerUserRole()` if they are missing).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make it functional, with internet identity log in for admin, me."
        ]
      },
      "acceptanceCriteria": [
        "The backend candid includes callable methods that match what the frontend calls for admin checks (e.g., `isCallerAdmin()` returns a Bool and `getCallerUserRole()` returns a role type).",
        "When called by an authenticated principal, the role/admin checks return results consistent with the backend’s access-control state (admin principals return true for `isCallerAdmin()`; non-admin principals return false).",
        "Unauthenticated callers (anonymous) do not cause the canister to trap during admin checks; they should return a safe value (e.g., false) or a controlled error that the UI can handle."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Make the requester able to log in with Internet Identity and be treated as an admin by supporting configuration of an initial admin Principal in the backend (deploy-time or equivalent configuration), and ensure that principal has admin permissions in the access-control state.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make it functional, with internet identity log in for admin, me."
        ]
      },
      "acceptanceCriteria": [
        "There is a clear, repeatable way to set an initial admin Principal for a new deployment (documented in code via comments/config), without requiring any external auth provider beyond Internet Identity.",
        "After logging in with Internet Identity as the configured initial admin principal, the backend authorizes admin-only methods (add/update/delete product, set Stripe configuration) without trapping for authorization.",
        "A non-admin Internet Identity principal cannot successfully call admin-only backend methods and receives an authorization error/trap as before."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Verify and fix any frontend integration issues preventing Internet Identity login from enabling admin functionality, so that after the requester logs in, the Admin navigation entry appears and all admin pages are accessible only to admins.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make it functional, with internet identity log in for admin, me."
        ]
      },
      "acceptanceCriteria": [
        "When not logged in, admin pages show an \"Authentication Required\" message and do not display admin content.",
        "When logged in as a non-admin, admin pages show an \"Access Denied\" message and do not display admin content.",
        "When logged in as the configured admin principal, the Admin link is visible in the header and the admin pages load successfully (dashboard, products CRUD page, Stripe setup page)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths; compose existing components instead.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Adding any authentication system other than Internet Identity.",
    "Implementing real-time features (WebSockets), external databases, or third-party auth providers.",
    "Changing the storefront UI beyond what is required to ensure Internet Identity/admin functionality works end-to-end."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}