{
  "kind": "build_request",
  "title": "Enable additional Stripe payment methods (card, cryptocurrency, Cash App, AU bank account)",
  "projectName": "Ocarina Store Clone",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Extend the backend Stripe configuration so an admin can enable Stripe Checkout payment methods for: card, cryptocurrency, Cash App, and Australian bank account (AU direct debit), and persist these settings in the canister configuration used by checkout-session creation.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-payment-methods",
          "msg-user-retry"
        ],
        "quotes": [
          "allow all payment methods available on stripe card, cryptocurrency, cash app, au bank account",
          "retry"
        ]
      },
      "acceptanceCriteria": [
        "Admin can set Stripe configuration with secret key, allowed countries, and enabled payment methods including: card, cryptocurrency, Cash App, and AU bank account (AU direct debit).",
        "If cryptocurrency/Cash App/AU bank account are not available for the Stripe account or region, the backend surfaces a clear error message (trap or returned error) rather than silently misconfiguring checkout.",
        "The backend uses the configured payment-method settings when calling Stripe to create a Checkout Session."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update the admin Payment Settings UI to allow selecting which Stripe payment methods are enabled (card, cryptocurrency, Cash App, AU bank account) in addition to the existing secret key and allowed-countries fields, using clear English labels and validation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-payment-methods",
          "msg-user-retry"
        ],
        "quotes": [
          "allow all payment methods available on stripe card, cryptocurrency, cash app, au bank account",
          "retry"
        ]
      },
      "acceptanceCriteria": [
        "The Payment Settings page includes toggles/checkboxes for: Card, Cryptocurrency, Cash App, and AU Bank Account (AU direct debit).",
        "Saving payment settings updates the backend configuration via the existing `setStripeConfiguration` mutation and shows success/failure toasts in English.",
        "The UI validates that at least one payment method is selected before allowing save (or defaults to Card enabled if none selected, as an explicit UI behavior)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Ensure the storefront checkout flow uses the updated Stripe configuration so that, when enabled, Stripe Checkout presents the additional payment methods to the buyer (subject to Stripe eligibility for the account/country/currency).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-payment-methods",
          "msg-user-retry"
        ],
        "quotes": [
          "allow all payment methods available on stripe card, cryptocurrency, cash app, au bank account",
          "retry"
        ]
      },
      "acceptanceCriteria": [
        "With Card + at least one additional method enabled in admin settings, creating a checkout session succeeds and the hosted Stripe Checkout page shows the enabled methods when Stripe deems them eligible.",
        "If an enabled method is ineligible (e.g., unsupported currency/country), the app fails gracefully (toast on frontend: \"Failed to create checkout session\") and logs a useful error for debugging."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not modify any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implement non-Stripe payment rails (e.g., native crypto wallets, bank transfers outside Stripe, Cash App integrations outside Stripe).",
    "Add third-party authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}