{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Internet Identity admin gating and navigation visibility",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Fix Internet Identity frontend integration so admin navigation and admin-page access reflect authenticated admin status",
      "acceptanceCriteria": [
        "When not logged in, admin pages show an \"Authentication Required\" message and do not display admin content.",
        "When logged in as a non-admin, admin pages show an \"Access Denied\" message and do not display admin content.",
        "When logged in as the configured admin principal, the Admin link is visible in the header and the admin pages load successfully (dashboard, products CRUD page, Stripe setup page)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the admin-check query hook to better support the authorization component flow: allow the caller to disable admin queries when not authenticated, and handle backend authorization/admin-check errors gracefully (treat as non-admin) so the UI can reliably render \"Authentication Required\" / \"Access Denied\" states without breaking. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Ensure admin-route gating uses Internet Identity authentication state first, and only runs admin status checks when authenticated (using the updated admin-check hook). Keep user-facing messaging in English (\"Authentication Required\" vs \"Access Denied\") and ensure admin content never renders for unauthenticated/non-admin users. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/StoreLayout.tsx",
          "operation": "modify",
          "description": "Make Admin navigation visibility depend on authenticated admin status without triggering admin checks for anonymous users (avoid unnecessary/fragile calls while logged out). Ensure the Admin link appears after successful Internet Identity login as an admin and disappears on logout. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}